"use client";
import React, { Component } from "react";
import Image from "next/image";
import { Card, CardContent } from "@/components/ui/card";
import "slick-carousel/slick/slick.css";
import "slick-carousel/slick/slick-theme.css";
import CarouselSlider from "@/components/CarouselSlider";
import Testimonial from "./Testimonial";

const testimonials = [
  {
    name: "খান মিরাজ",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "এখানে কোর্স করার পর যতটুকু বুঝলাম এই কোর্স করতে হলেও একটা যোগ্যতা দরকার। একবার দেখা শেষ করেছি আবার করবো নোট করে করে। এমন ভিডিও আসে ১০ বারের উপরে দেখেছি বুঝার জন্য সেগুলো নিয়ে প্রচুর রিসার্চ করতে হবে। কেউ যদি মনে করে এখানে মুখে তুলে খাওয়ায় দিবে এরকম কোর্স এটা না যে ভিডিও দেখলেন আর হয়ে গেলো। সামনের মাসে লিংকেবল কন্টেন্ট রিসার্চ করে প্রেক্টিকাল স্কাইস্ক্রেপার মেথডে কাজ করার চেষ্টা করবো প্রথম লিঙ্কবিল্ডিং। চেষ্টা করবো সেই রেজাল্ট ও আপনাদের সাথে শেয়ার করার।",
    img: "/images/testimonials/miraz.jpg",
  },
  {
    name: "কাজী নূর",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "সবে মাত্র ভিডিও গুলো দেখা শেষ করেছি। তাতেই বুঝতে পারলাম যে আবারো অনেক বার দেখতে হবে ভিডিও গুলো এবং যে নিখুত ব্যাপার গুলো সহজ ভাবে বোঝানো হয়েছে সেই মোতাবেক কাজ করে যেতে হবে। নিঃসন্দেহে এই কোর্স আপনাকে প্রচলিত লিঙ্ক বিল্ডিং এর সব ধারনা থেকে বের করে নিয়ে আসবে বলে আমার বিশ্বাস। যারা ওয়ার্ল্ড ক্লাস লিঙ্ক বিল্ডিং এক্সপার্ট হতে চায়, তাদের কে আমি এই কোর্স টি অবশ্যই রেকমেন্ড করবো। কারন এতে মার্কেটপ্লেস, ক্যারিয়ার সেটআপ, কিভাবে সার্ভিস সেল করবেন এবং আরও নানান বিষয়ে লেসন দেয়া আছে। সুতরাং এটি নিঃসন্দেহে আপনার জন্য একটি উত্তম কোর্স হবে যদি আপনি একজন ভাল মানের লিঙ্ক বিল্ডিং এক্সপার্ট হতে চান।",
    img: "/images/testimonials/nur.jpg",
  },
  {
    name: "মোঃ আল শাহরিয়ার",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "প্রায়োগিক লিংক বিল্ডিং কোর্সটা এনরোল করার পরেঃনিউবি হিসেবে লিংক বিল্ডিং নিয়ে আমার অনেক কনফিউশন এবং ভয় কাজ করতো।এই বিষয়ে, অনলাইনে খুজেও খুব বেশি রিসোর্স পাইনি, পেলেও বিক্ষিপ্ত আকারে ছিলো। যা দিয়ে খুব একটা আগাতে পারিনি।এক্ষেত্রে, আমাদের দেশে লিংক বিল্ডিং নিয়ে এর আগে এমন গুছানো,ক্লিয়ার কোন কোর্স বা গাইড লাইন পাইনি। এই কোর্সটিতে সবকিছু একটি প্লাটফর্মে পেয়েছি।এই কোর্সটিতে লিংক বিল্ডিং এ ক্যারিয়ার সেট আপ করার ক্ষেত্রেও বিস্তারিত দিকনির্দেশনা দেয়া আছে।সবমিলিয়ে, কোর্সটি খুবই ভালো লেগেছে আমার কাছে।",
    img: "/images/testimonials/rasel.jpg",
  },
  {
    name: "রাসেল আহমেদ রাজু",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "এসইওর অনেক টিউটোরিয়াল দেখেছি। নানা রকমের টোটকা পদ্ধতি দেখেছি। কিন্তু প্রায়গিকের কোর্স করে মনে হচ্ছে আসলেই একটি জিনিস শিখলাম যা সারাজীবন কাজে লাগবে। যেখানেই চাকুরী বা ব্যাবসা করি এর প্রভাব আমার সব কাজেই পড়বে। পুরা ফ্যাটলেস টিউটোরিয়াল। কোন অপ্রয়োজনীয় কথা নেই। ভিডিও গুলো ছোট ছোট কিন্তু ভ্যালু ছিল অনেক বেশি। ব্রেইনস্ট্রমিং অটোম্যাটিক শুরু হয়ে যায়। এটা বুঝলাম ভ্যালুয়েবল কন্টেন্ট প্রডিউস করে প্রপারলি আউটরিচ করে লিংক পাওয়া সহজ। এবং সেটা প্রচুর সংখ্যক।",
    img: "/images/testimonials/rasel.jpg",
  },
  {
    name: "এ বি এস মোর্শেদ",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "প্রায়োগিক লিংক বিল্ডিং কোর্সটা এনরোল করার পরেঃনিউবি হিসেবে লিংক বিল্ডিং নিয়ে আমার অনেক কনফিউশন এবং ভয় কাজ করতো।এই বিষয়ে, অনলাইনে খুজেও খুব বেশি রিসোর্স পাইনি, পেলেও বিক্ষিপ্ত আকারে ছিলো। যা দিয়ে খুব একটা আগাতে পারিনি।এক্ষেত্রে, আমাদের দেশে লিংক বিল্ডিং নিয়ে এর আগে এমন গুছানো,ক্লিয়ার কোন কোর্স বা গাইড লাইন পাইনি। এই কোর্সটিতে সবকিছু একটি প্লাটফর্মে পেয়েছি।এই কোর্সটিতে লিংক বিল্ডিং এ ক্যারিয়ার সেট আপ করার ক্ষেত্রেও বিস্তারিত দিকনির্দেশনা দেয়া আছে।সবমিলিয়ে, কোর্সটি খুবই ভালো লেগেছে আমার কাছে।",
    img: "/images/testimonials/morshad.jpg",
  },
  {
    name: "এ বি এস মোর্শেদ",
    designation: "ফাউন্ডার, এক্সভেট",
    details:
      "বুটক্যাম্প-১ এর পর নিস সাইটের কিওয়াড রিসার্চ করতে করতে ভাবলাম মার্কেটপ্লেসে বিড করি। ১ম বিডে ৭৫ ডলারের কাজ পেলাম।এখন মনে হচেছ বুটক্যাম্প-১ থেকে অনেক কিছু শিখতে পেড়েছি। আত্ম বিশ্বাস অনেক বেড়েছে। ডলারের অংক ছোট হলে ও আমার জন্যে বড় পাওয়া।",
    img: "/images/testimonials/shaharia.jpg",
  },
];

export default class Testimonials extends Component {
  render() {
    return (
      <div>
        <div className="bg-black">
          <div className="mx-auto max-w-7xl px-6 lg:px-8 py-24 overflow-hidden">
            <div className="mx-auto max-w-none sm:max-w-lg text-center mt-2  text-3xl font-bold tracking-tight text-white sm:text-4xl">
              <p>প্রায়োগিকের উদ্যোগ সম্পর্কে</p>
              <p className="text-primary-400">
                মার্কেটিং ইন্ড্রাস্ট্রি এক্সপার্টদের মতামত
              </p>
            </div>
            <CarouselSlider
              slidesToShow={3}
              itemLg={3}
              itemMd={2}
              itemSm={1}
              slidesToScroll={1}
              scrollLg={1}
              scrollMd={1}
              scrollSm={1}
              breakMd={896}
              autoplay={true}
              autoplaySpeed={5000}
            >
              {testimonials.map((item, i) => (
                <Testimonial item={item} key={i} />
              ))}
            </CarouselSlider>
          </div>
        </div>
      </div>
    );
  }
}
