import React from "react";

export default function page() {
  return (
    <div className="mx-auto py-10 lg:py-16 max-w-4xl">
      <div className="bg-white rounded-lg drop-shadow overflow-hidden w-full p-8 md:p-10">
        <h1 className="mt-2 text-3xl md:text-3xl font-bold mb-[30px]">
          শর্তাবলী
        </h1>
        {/* Content */}
        <div className="space-y-[30px]">
          <p className="text-base text-gray-700">
            কোর্সে শেষে আয় কিংবা ক্যারিয়ার গ্যারান্টিড নাঃ কোর্সে অংশগ্রহন
            প্রস্তুত ও সম্ভাবনা তৈরি করবে
          </p>
          <p className="text-base text-gray-700">
            অধিকাংশ কোর্সই পেশা ভিত্তিক কিংবা আয় সংক্রান্ত। কোর্সের আউটকাম কেমন
            হতে পারে তার ধারনা দেয়ার জন্য আমরা আয়ের একটা ধারনা দেই। কিংবা বলি
            কেমন কাজের সুযোগ আছে কিংবা হবে। কাজ, ক্যারিয়ার ও আয়ের সুযোগ অনলাইনে
            পাওয়া তথ্য যেমন ফ্রিল্যান্স মার্কেটে কাজের ডিমান্ড, বিভিন্ন ফোরামের
            আলোচনা, স্কিল ডিমান্ডের ট্রেন্ড এনালাইসিস ইত্যাদি থেকে নিয়ে থাকি।
          </p>
          <p className="text-base text-gray-700">
            তথ্য গুলো সত্য ও বাস্তব মনে করেইআমরা উল্ল্যেখ করি। এছাড়া আমাদের
            এক্সপার্টদের অভিজ্ঞতাও আমরা বিবেচনায় নেই।
          </p>
          <p className="text-base text-gray-700">
            কোর্সে ভর্তি হলেই আপনি সেই রকম অর্থ আয় করবেন কিংবা আপনার ক্যারিয়ার
            ঠিক তেমন হয়ে যাবে তা ১০০% নিশ্চিত না।
          </p>
          <p className="text-base text-gray-700">
            কেমন সফল হবে তা অনেক কিছুর উপর নির্ভর করে। কেউ কতটুকু পড়াশুনা করছে,
            চর্চা করছে, কি ধরনের প্রজেক্টের জন্য চেস্টা করছে, সঠিক জায়গায় সঠিক
            সময়ে উপস্থিত থাকছে কিনা এই বিষয় গুলোর উপর অংশগ্রহণকারীদের সাফল্য
            নির্ভর করবে।
          </p>
          <p className="text-base text-gray-700">
            কোর্স সম্ভাবনার জন্য প্রস্তুত করে তোলে। কোর্সে অংশগ্রহন করার পর
            ব্যক্তির প্রচেস্টা ও কোর্সের বিষয় গুলো আয়ত্বে আনা অংশগ্রহণ কারীর উপর
            নির্ভরশীল।
          </p>
          <p className="text-base text-gray-700">
            আমাদের পরামর্শ হচ্ছে কোর্সে নিবন্ধন করার আগে অবশ্যয় সিনিয়র কোন
            প্রফেশনালের সাথে পরামর্শ করে নেবেন। আমাদের পুরাতন প্রশিক্ষনার্থীদের
            ফিডব্যাক দেখবেন, কাউকে চিনলে তার সাথে আলাপ করে নিশ্চিত হয়ে নিবেন।
            কোন বিষয় পরিস্কার ভাবে বুঝে নেয়ার জন্য আমাদের সাথে যোগাযোগ করবেন।
          </p>
          <p className="text-base text-gray-700 flex flex-col">
            <span className="font-bold text-gray-950">
              রিফান্ড ও ক্যান্সল্যাশন:
            </span>{" "}
            <span>
              ১. নির্দিষ্ট কোন কোর্সে রিফাণ্ডের ঘোষনা থাকলে – ক্রয়ের ৭ দিনের
              মধ্যে রিফান্ড রিকোয়েস্ট করা যাবে। (শুধুমাত্র এককালীন ক্রয়কৃত
              কোর্সে)
            </span>
            <span>
              ২. যে কোনো সময় সাবস্ক্রিপশন বাতিল করা যাবে। এক্ষেত্রে রিফান্ডের
              কোনো সুযোগ নেই।
            </span>
          </p>

          <p className="text-base text-gray-700 flex flex-col">
            <span className="font-bold text-gray-950">একাউণ্টঃ </span> কোন ভাবেই
            অন্য কারো সাথে শেয়ার করা যাবে না। শেয়ার করলে বিষয়টি আমাদের দৃস্টি
            গোছর হলে একাউন্ট অবশ্যয় বাতিল হবে। কোন প্রকার রিফান্ড করা হবে না।
          </p>
          <p className="text-base text-gray-700 flex flex-col">
            <span className="font-bold text-gray-950">
              কোর্স কনটেণ্ট ডাউনলোড ও শেয়ার{" "}
            </span>{" "}
            কোন ভাবেই কোর্সের কনটেণ্ট ডাউনলোড ও তা শেয়ার করা যাবে না। কেউ করলে
            তার একাউন্ট বাতিল ও আইন অনুযায়ী ব্যবস্থা নেয়া হবে।
          </p>
          <p className="text-base text-gray-700 flex flex-col">
            <span className="font-bold text-gray-950">রেফারেল ফিঃ </span>{" "}
            রেফারলে ফি প্রদান বিশ্বব্যাপি বহুল প্রচলিত আকর্ষনী ও কার্যকর একটা
            বিপনন কৌশল। বিপনন কৌশল হিসাবে আমরা রেফারেল ফি দিয়ে থাকি।
          </p>
        </div>
      </div>
    </div>
  );
}
